{
  "sources": [
    {
      "title": "Wait But Why",
      "feedUrl": "https://waitbutwhy.com/feed",
      "siteUrl": "https://waitbutwhy.com",
      "articles": []
    },
    {
      "title": "Paul Graham: Essays",
      "feedUrl": "https://rsshub.app/blogs/paulgraham",
      "siteUrl": "http://www.paulgraham.com/articles.html",
      "articles": [
        {
          "id": "http://www.paulgraham.com/own.html",
          "author": null,
          "description": "June 2021\nA few days ago, on the way home from school, my nine year old son\ntold me he couldn't wait to get home to write more of the story he\nwas working on. This made me as happy as anything I've heard him\nsay — not just because he was excited about his story, but because\nhe'd discovered this way of working. Working on a project of your\nown is as different from ordinary work as skating is from walking.\nIt's more fun, but also much more productive.\nWhat proportion of great work has been done by people who were\nskating in this sense? If not all of it, certainly a lot.\nThere is something special about working on a project of your own.\nI wouldn't say exactly that you're happier. A better word would be\nexcited, or engaged. You're happy when things are going well, but\noften they aren't. When I…",
          "link": "http://www.paulgraham.com/own.html",
          "publishedOn": "2022-01-11T19:28:29.978Z",
          "wordCount": 2486,
          "title": "A Project of One's Own"
        },
        {
          "id": "http://www.paulgraham.com/weird.html",
          "author": null,
          "description": "August 2021\nWhen people say that in their experience all programming languages\nare basically equivalent, they're making a statement not about\nlanguages but about the kind of programming they've done.\n99.5% of programming consists of gluing together calls to library\nfunctions. All popular languages are equally good at this. So one\ncan easily spend one's whole career operating in the intersection\nof popular programming languages.\nBut the other .5% of programming is disproportionately interesting.\nIf you want to learn what it consists of, the weirdness of weird\nlanguages is a good clue to follow.\nWeird languages aren't weird by accident. Not the good ones, at\nleast. The weirdness of the good ones usually implies the existence\nof some form of programming that's not just the usual gluing togeth…",
          "link": "http://www.paulgraham.com/weird.html",
          "publishedOn": "2022-01-11T19:28:29.971Z",
          "wordCount": 348,
          "title": "Weird Languages"
        },
        {
          "id": "http://www.paulgraham.com/hwh.html",
          "author": null,
          "description": "June 2021\nIt might not seem there's much to learn about how to work hard.\nAnyone who's been to school knows what it entails, even if they\nchose not to do it. There are 12 year olds who work amazingly hard. And\nyet when I ask if I know more about working hard now than when I\nwas in school, the answer is definitely yes.\nOne thing I know is that if you want to do great things, you'll\nhave to work very hard. I wasn't sure of that as a kid. Schoolwork\nvaried in difficulty; one didn't always have to work super hard to\ndo well. And some of the things famous adults did, they seemed to\ndo almost effortlessly. Was there, perhaps, some way to evade hard\nwork through sheer brilliance? Now I know the answer to that question.\nThere isn't.\nThe reason some subjects seemed easy was that my school had low\ns…",
          "link": "http://www.paulgraham.com/hwh.html",
          "publishedOn": "2022-01-11T19:28:29.960Z",
          "wordCount": 3276,
          "title": "How to Work Hard"
        },
        {
          "id": "http://www.paulgraham.com/smart.html",
          "author": null,
          "description": "October 2021\nIf you asked people what was special about Einstein, most would say\nthat he was really smart. Even the ones who tried to give you a\nmore sophisticated-sounding answer would probably think this first.\nTill a few years ago I would have given the same answer myself. But\nthat wasn't what was special about Einstein. What was special about\nhim was that he had important new ideas. Being very smart was a\nnecessary precondition for having those ideas, but the two are not\nidentical.\nIt may seem a hair-splitting distinction to point out that intelligence\nand its consequences are not identical, but it isn't. There's a big\ngap between them. Anyone who's spent time around universities and\nresearch labs knows how big. There are a lot of genuinely smart\npeople who don't achieve very much.\nI g…",
          "link": "http://www.paulgraham.com/smart.html",
          "publishedOn": "2022-01-11T19:28:29.942Z",
          "wordCount": 1406,
          "title": "Beyond Smart"
        },
        {
          "id": "http://www.paulgraham.com/goodtaste.html",
          "author": null,
          "description": "November 2021\n(This essay is derived from a talk at the Cambridge Union.)\nWhen I was a kid, I'd have said there wasn't. My father told me so.\nSome people like some things, and other people like other things,\nand who's to say who's right?\nIt seemed so obvious that there was no such thing as good taste\nthat it was only through indirect evidence that I realized my father\nwas wrong. And that's what I'm going to give you here: a proof by\nreductio ad absurdum. If we start from the premise that there's no\nsuch thing as good taste, we end up with conclusions that are\nobviously false, and therefore the premise must be wrong.\nWe'd better start by saying what good taste is. There's a narrow\nsense in which it refers to aesthetic judgements and a broader one\nin which it refers to preferences of any kin…",
          "link": "http://www.paulgraham.com/goodtaste.html",
          "publishedOn": "2022-01-11T19:28:29.928Z",
          "wordCount": 1123,
          "title": "Is There Such a Thing as Good Taste?"
        }
      ]
    },
    {
      "title": "LessWrong",
      "feedUrl": "http://lesserwrong.com/feed.xml",
      "siteUrl": "https://www.lesswrong.com",
      "articles": [
        {
          "id": "pZaPhGg2hmmPwByHc",
          "author": "jsteinhardt",
          "description": "Published on January 11, 2022 7:50 PM GMT\n\nIn 1972, the Nobel prize-winning physicist Philip Anderson wrote the essay \"More Is Different\". In it, he argues that quantitative changes can lead to qualitatively different and unexpected phenomena. While he focused on physics, one can find many examples of More is Different in other domains as well, including biology, economics, and computer science. Some examples of More is Different include:\nUranium. With a bit of uranium, nothing special happens; with a large amount of uranium packed densely enough, you get a nuclear reaction.\nDNA. Given only small molecules such as calcium, you can’t meaningfully encode useful information; given larger molecules such as DNA, you can encode a genome.\nWater. Individual water molecules aren’t wet. Wetness only…",
          "link": "https://www.lesswrong.com/posts/pZaPhGg2hmmPwByHc/future-ml-systems-will-be-qualitatively-different",
          "publishedOn": "2022-01-11T19:50:12.000Z",
          "wordCount": 1586,
          "title": "Future ML Systems Will Be Qualitatively Different"
        },
        {
          "id": "5BkEoJFEqQEWy9GcL",
          "author": "PabloAMC",
          "description": "Published on January 11, 2022 11:28 AM GMT\n\nThis is a proposal I wrote for the recent Open Philanthropy call on AI Alignment projects. I am finishing my Ph.D. in quantum computing and I would like to start working on AI Alignment. Thus, this is my proposal for a postdoc-style grant to learn more about one area I think the community could pay more attention to. However, since I am quite new to this area, there might be things that I have overlooked. For that reason, if you see something that doesn't sound promising, or you disagree with it, I would be happy to know about it.\nThe proposal received some light comments from Victor Veitch, Ryan Carey, and José Hernández-Orallo. I also received some comments from Jaime Sevilla during the ideation phase. I am really grateful to all of them for th…",
          "link": "https://www.lesswrong.com/posts/5BkEoJFEqQEWy9GcL/an-open-philanthropy-grant-proposal-causal-representation",
          "publishedOn": "2022-01-11T11:28:02.000Z",
          "wordCount": 2863,
          "title": "An Open Philanthropy grant proposal: Causal representation learning of human preferences"
        },
        {
          "id": "FG7mgPFytq2a3rjJq",
          "author": "karlkeefer",
          "description": "Published on January 11, 2022 6:05 AM GMT\n\nLots has been written here about gratitude journaling.\nIn spite of knowing about the benefits, I've never managed to make the habit stick. I do, however, already have a very strong habit of responding to email and keeping my inbox under control.\nThat's what pushed me to build Email Notebook, which I'm hopeful will facilitate other folks' writing habits, too.\nIt's beta quality at the moment, but my email is on the contact page and I plan to put some effort into feature requests if there are any common themes. Already on the roadmap is to improve the variety of prompts, touching on some of the specific practices outlined by @david_gross.\nIf you do give it a try, please report any bugs you encounter :)\nDiscuss",
          "link": "https://www.lesswrong.com/posts/FG7mgPFytq2a3rjJq/emails-from-your-gratitude-journal",
          "publishedOn": "2022-01-11T06:05:28.000Z",
          "wordCount": 168,
          "title": "Emails from your Gratitude Journal"
        },
        {
          "id": "NYH8kjdpLCTXcit8C",
          "author": "Elmer of Malmesbury",
          "description": "Published on January 11, 2022 5:11 AM GMT\n\nCross-post from Telescopic Turnip.\nEvery problem is a calibration problem. That’s why most advice is basically useless: it tells you what to do, but doesn’t tell you when to stop. Therefore, the best pieces of advice are calibration advice. What we need is a metric to know if we are doing well, or if we should change our habits (and in which direction). For example, here are two poor pieces of advice:\n\"You should spend more time reading blogs, because compared to traditional media, bloggers have more freedom to communicate in original ways, and are more accountable when they say something false.\"\n\"You should spend less time reading blogs, because keeping up with a big pile of subscriptions takes a lot of time and makes you anxious.\"\nNeither of the…",
          "link": "https://www.lesswrong.com/posts/NYH8kjdpLCTXcit8C/calibration-proverbs",
          "publishedOn": "2022-01-11T05:11:53.000Z",
          "wordCount": 537,
          "title": "Calibration proverbs"
        },
        {
          "id": "tQQaAuTtMCkYBbZcj",
          "author": "aphyer",
          "description": "Published on January 11, 2022 1:29 AM GMT\n\nThis is a follow-up to last week's D&D.Sci scenario: if you intend to play that, and haven't done so yet, you should do so now before spoiling yourself.\nFull generation code is available here if you are interested, or you can read on.\nRULESET\nEach of the six toys makes a different amount of noise depending on what child receives it:\n\nA Blum-Blooper makes 6 noise.\nA Fum-Foozler is more popular with female Who children - it makes 8 noise with a female Who child but only 4 noise with a male one.\nA Gah-Ginka is very noisy, but too simple to hold the attention of older children for long.  It makes 11 noise - 1/2 (rounded down) the child's age (so anywhere from 11 for an Age 1 child to 5 for an Age 12 child).\nA Sloo-Slonker is complicated, and small Who…",
          "link": "https://www.lesswrong.com/posts/tQQaAuTtMCkYBbZcj/d-and-d-sci-holiday-special-how-the-grinch-pessimized-1",
          "publishedOn": "2022-01-11T01:29:59.000Z",
          "wordCount": 1396,
          "title": "D&D.Sci Holiday Special: How the Grinch Pessimized Christmas Evaluation & Ruleset"
        },
        {
          "id": "F2LS4tjbNDnLAsdbp",
          "author": "dkirmani",
          "description": "Published on January 10, 2022 9:28 PM GMT\n\nAbstractions are important.\n\nIn order to think in terms of \"trees\" and \"birds\" instead of raw retinal activation rates, human minds need to form abstractions.\nIn order to keep Nature red in tooth and claw, organisms must first evolve abstractions like \"tooth\" and \"claw\".\nNeural networks can learn human abstractions.\nFiguring out abstraction is possibly \"the main foundational piece\" of successful AI alignment.\nAbstractions are functions that map a high-dimensional space to a low-dimensional space. They have more possible inputs than possible outputs, so abstractions have to shed some information.\nAbstractions filter out useless information, while keeping useful information.\nIn order for there to be such a thing as \"useful information\", there must be some goal(s) being pursued.\nYou might argue that \"abstraction\" only means preserving information used to predict faraway observations from a given system. However, coarse modeling of distant objects is often a convergent subgoal of the kind of organisms that Nature selects for.\nThe scout does not tell the general about the bluejays he saw. He reports the number of bombers in the enemy's hangar. Condensation of information always selects for goal-relevant information. Any condensation of information implies that the omitted information is less goal-relevant than the reported information; there is no abstraction without a goal.\nDiscuss",
          "link": "https://www.lesswrong.com/posts/F2LS4tjbNDnLAsdbp/no-abstraction-without-a-goal-1",
          "publishedOn": "2022-01-10T21:28:58.000Z",
          "wordCount": 1522,
          "title": "No Abstraction Without a Goal"
        },
        {
          "id": "kwxDe6ACmepiJEzEj",
          "author": "Birke",
          "description": "Published on January 10, 2022 7:53 PM GMT\n\nLook at the following statements*:\n- “India and Pakistan can agree on one thing: neither wants the other one around.”\n- “The Americans don’t really want to fight for the South Koreans, but nor can they afford to be seen to be giving up on a friend.”\n- “What is now the EU was set up so that France and Germany could hug each other so tightly in a loving embrace that neither would be able to get an arm free with which to punch the other.”\nI don't want to argue whether these statements are true or not. What's bugging me is that they all contain an implicit assumption that a state acts as an intelligent agent at least and as a rational agent at most**.\nIs this assumption true?\nA state is a complex system which comprise civilians, military, businesses and different government branches. These parts may have different and even opposite goals and values and they can constrain each other. Will interactions between those parts lead to a (more or less) rational behavior of a whole?\nDo you know a good book or article which reflects on this issue?\n \n---\n* Quotes from \"Prisoners of Geography\" by Tim Marshall\n** I guess many people assume that states are human-like rational\n\nDiscuss",
          "link": "https://www.lesswrong.com/posts/kwxDe6ACmepiJEzEj/is-state-a-semi-rational-agent",
          "publishedOn": "2022-01-10T19:53:25.000Z",
          "wordCount": 369,
          "title": "Is state a (semi-) rational agent?"
        },
        {
          "id": "tkhQC9YBgQAcgBLRP",
          "author": "dadadarren",
          "description": "Published on January 10, 2022 7:47 PM GMT\n\nThis is another attempt to promote my approach to anthropic paradoxes. I framed the argument differently hopefully making it more clear. Please refer to my website for more. \nWhat \"I\" Means\nIn the strict indexical sense, \"I\" just means the first person. However we also often interpret it as the physical person uttering the word and usually equate the two meanings, \"I am this physical person\" after all. But there is a caveat. The equivalency is bound by the perspective. \nThe first person meaning of \"I\" is restricted to its own viewpoint, from other perspectives only the physical meaning can be used. If I hear you say \"I'm hungry\", to me the only correct way of interpreting it would be the physical person \"[insert reader name] is hungry\", not that \"…",
          "link": "https://www.lesswrong.com/posts/tkhQC9YBgQAcgBLRP/the-first-person-and-the-physical-person",
          "publishedOn": "2022-01-10T19:47:51.000Z",
          "wordCount": 1408,
          "title": "The First Person And The Physical Person"
        },
        {
          "id": "MDfesb7oYu8KhGvLR",
          "author": "NunoSempere",
          "description": "Published on January 10, 2022 7:35 PM GMT\n\nHighlights\n\nPolymarket’s future is uncertain after it settled with the CFTC for $1.4M\nAstral Codex Ten gives out $40k to forecasting projects\nMany people, including Mathew Yglesias, write predictions for 2022.\nEli Lifland writes the reference piece on bottlenecks to impactful forecasting\nGoogle reveals the existence of a gigantic new internal prediction market\nA new forecasting platform appears, Manifold Markets\n\nIndex\n\nPrediction Markets & Forecasting Platforms\nLong Content\nBlog Posts\nIn The News\n\nYou can sign up for this newsletter on substack, or browse past newsletters here. If you have a content suggestion or want to reach out, you can leave a comment or find me on Twitter. A big hat tip goes to Nathan Young and Clay Graubard for comments and…",
          "link": "https://www.lesswrong.com/posts/MDfesb7oYu8KhGvLR/forecasting-newsletter-december-2021",
          "publishedOn": "2022-01-10T19:35:41.000Z",
          "wordCount": 2746,
          "title": "Forecasting Newsletter: December 2021"
        },
        {
          "id": "LfrNFfJFcqnG9WuFf",
          "author": "Maxwell Peterson",
          "description": "Published on January 10, 2022 7:26 PM GMT\n\nActivated charcoal is charcoal that has been heated up a whole lot and then washed really hard, by water or acid. This process is what \"activates\" it, and activating it increases the surface area by a lot. I think it prevents hangovers.\nI won't spend too much time in this post arguing that activated charcoal works. Instead, I'll mostly take for granted that it does, then take a tour of the various things that might cause hangovers, stopping at each to look at why activated charcoal might or might not be likely to reduce them. So even if you're sure activated charcoal is just a hokey health craze thing I've tricked myself into believing, this post still has lots of interesting hangover science you might not have heard about.\n \nI used to suffer vici…",
          "link": "https://www.lesswrong.com/posts/LfrNFfJFcqnG9WuFf/activated-charcoal-for-hangover-prevention-way-more-than-you",
          "publishedOn": "2022-01-10T19:26:54.000Z",
          "wordCount": 10750,
          "title": "Activated Charcoal for Hangover Prevention: Way more than you wanted to know"
        }
      ]
    }
  ],
  "cliVersion": "1.12.0"
}