{
  "sources": [
    {
      "title": "Wait But Why",
      "feedUrl": "https://waitbutwhy.com/feed",
      "siteUrl": "https://waitbutwhy.com",
      "articles": []
    },
    {
      "title": "Paul Graham: Essays",
      "feedUrl": "https://rsshub.app/blogs/paulgraham",
      "siteUrl": "http://www.paulgraham.com/articles.html",
      "articles": [
        {
          "id": "http://www.paulgraham.com/hwh.html",
          "author": null,
          "description": "June 2021\nIt might not seem there's much to learn about how to work hard.\nAnyone who's been to school knows what it entails, even if they\nchose not to do it. There are 12 year olds who work amazingly hard. And\nyet when I ask if I know more about working hard now than when I\nwas in school, the answer is definitely yes.\nOne thing I know is that if you want to do great things, you'll\nhave to work very hard. I wasn't sure of that as a kid. Schoolwork\nvaried in difficulty; one didn't always have to work super hard to\ndo well. And some of the things famous adults did, they seemed to\ndo almost effortlessly. Was there, perhaps, some way to evade hard\nwork through sheer brilliance? Now I know the answer to that question.\nThere isn't.\nThe reason some subjects seemed easy was that my school had low\ns…",
          "link": "http://www.paulgraham.com/hwh.html",
          "publishedOn": "2022-02-12T01:02:30.216Z",
          "wordCount": 3276,
          "title": "How to Work Hard"
        },
        {
          "id": "http://www.paulgraham.com/own.html",
          "author": null,
          "description": "June 2021\nA few days ago, on the way home from school, my nine year old son\ntold me he couldn't wait to get home to write more of the story he\nwas working on. This made me as happy as anything I've heard him\nsay — not just because he was excited about his story, but because\nhe'd discovered this way of working. Working on a project of your\nown is as different from ordinary work as skating is from walking.\nIt's more fun, but also much more productive.\nWhat proportion of great work has been done by people who were\nskating in this sense? If not all of it, certainly a lot.\nThere is something special about working on a project of your own.\nI wouldn't say exactly that you're happier. A better word would be\nexcited, or engaged. You're happy when things are going well, but\noften they aren't. When I…",
          "link": "http://www.paulgraham.com/own.html",
          "publishedOn": "2022-02-12T01:02:30.194Z",
          "wordCount": 2486,
          "title": "A Project of One's Own"
        },
        {
          "id": "http://www.paulgraham.com/weird.html",
          "author": null,
          "description": "August 2021\nWhen people say that in their experience all programming languages\nare basically equivalent, they're making a statement not about\nlanguages but about the kind of programming they've done.\n99.5% of programming consists of gluing together calls to library\nfunctions. All popular languages are equally good at this. So one\ncan easily spend one's whole career operating in the intersection\nof popular programming languages.\nBut the other .5% of programming is disproportionately interesting.\nIf you want to learn what it consists of, the weirdness of weird\nlanguages is a good clue to follow.\nWeird languages aren't weird by accident. Not the good ones, at\nleast. The weirdness of the good ones usually implies the existence\nof some form of programming that's not just the usual gluing togeth…",
          "link": "http://www.paulgraham.com/weird.html",
          "publishedOn": "2022-02-12T01:02:29.864Z",
          "wordCount": 348,
          "title": "Weird Languages"
        },
        {
          "id": "http://www.paulgraham.com/goodtaste.html",
          "author": null,
          "description": "November 2021\n(This essay is derived from a talk at the Cambridge Union.)\nWhen I was a kid, I'd have said there wasn't. My father told me so.\nSome people like some things, and other people like other things,\nand who's to say who's right?\nIt seemed so obvious that there was no such thing as good taste\nthat it was only through indirect evidence that I realized my father\nwas wrong. And that's what I'm going to give you here: a proof by\nreductio ad absurdum. If we start from the premise that there's no\nsuch thing as good taste, we end up with conclusions that are\nobviously false, and therefore the premise must be wrong.\nWe'd better start by saying what good taste is. There's a narrow\nsense in which it refers to aesthetic judgements and a broader one\nin which it refers to preferences of any kin…",
          "link": "http://www.paulgraham.com/goodtaste.html",
          "publishedOn": "2022-02-12T01:02:29.859Z",
          "wordCount": 1123,
          "title": "Is There Such a Thing as Good Taste?"
        },
        {
          "id": "http://www.paulgraham.com/smart.html",
          "author": null,
          "description": "October 2021\nIf you asked people what was special about Einstein, most would say\nthat he was really smart. Even the ones who tried to give you a\nmore sophisticated-sounding answer would probably think this first.\nTill a few years ago I would have given the same answer myself. But\nthat wasn't what was special about Einstein. What was special about\nhim was that he had important new ideas. Being very smart was a\nnecessary precondition for having those ideas, but the two are not\nidentical.\nIt may seem a hair-splitting distinction to point out that intelligence\nand its consequences are not identical, but it isn't. There's a big\ngap between them. Anyone who's spent time around universities and\nresearch labs knows how big. There are a lot of genuinely smart\npeople who don't achieve very much.\nI g…",
          "link": "http://www.paulgraham.com/smart.html",
          "publishedOn": "2022-02-12T01:02:29.846Z",
          "wordCount": 1405,
          "title": "Beyond Smart"
        }
      ]
    },
    {
      "title": "Information is Beautiful",
      "feedUrl": "http://feeds.feedburner.com/InformationIsBeautiful",
      "siteUrl": "https://informationisbeautiful.net",
      "articles": []
    }
  ],
  "cliVersion": "1.12.0"
}